create_clock -period 20.000 -name clock -waveform {0.000 10.000} [get_ports clock]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports config_enable]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports config_enable]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports config_in]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports config_in]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports config_nreset]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports config_nreset]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports nreset]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports nreset]
set_output_delay -clock [get_clocks clock] -min -add_delay -1.000 [get_ports {data_east_out[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports {data_east_out[*]}]
set_output_delay -clock [get_clocks clock] -min -add_delay -1.000 [get_ports {data_north_out[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports {data_north_out[*]}]
set_output_delay -clock [get_clocks clock] -min -add_delay -1.000 [get_ports {data_south_out[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports {data_south_out[*]}]
set_output_delay -clock [get_clocks clock] -min -add_delay -1.000 [get_ports {data_west_out[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports {data_west_out[*]}]
set_output_delay -clock [get_clocks clock] -min -add_delay -1.000 [get_ports config_out]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports config_out]

set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {data_east_in[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports {data_east_in[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {data_north_in[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports {data_north_in[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {data_south_in[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports {data_south_in[*]}]
set_input_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {data_west_in[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 1.000 [get_ports {data_west_in[*]}]
